// map.c
#include <ansi.h>

inherit ITEM;

void create()
{
	set_name( HIC "『江陵旅遊圖』" NOR, ({ "luyou tu", "tu" }) );
	set_weight(10);
	if( clonep() )
		set_default_object(__FILE__);
	else {
		set("unit", "張");
		set("long", @TEXT
                 『江陵旅遊圖』

                            <三不管>
                                 ＼
                                  黃土路
                                    │
                ∧   ∧            北門
               ∧∧∧∧∧           │
               武當山∧∧    墓碑鋪-┼-打鐵鋪      ■荊州
                                    │
                             棺材鋪-西-小巷—小巷—東-元妙觀
            ∧                      │             │
          神∧∧               書鋪-┼-<知府衙門>—街-茶館
          龍∧∧                    街             │
          架∧∧             開元觀-┼-<萬家大院> 東門        
          ∧∧∧∧ — 古隆中       南門            │
              │        │          │             │        ∧
              │       山道—山道—山道—-山道——山道—山岡∧∧
              │                    │
              │           太暉觀—小屋
             山道                   │  ∧
              │             古廟—山岡 ∧∧
              │                    │
          ≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈
            白帝城—瞿塘峽—巫峽—西陵峽    ≈≈
          ≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈≈長
                   ∧        │             ≈≈
             長坂坡∧∧——當陽橋——城陵磯 ≈江
                             │             ≈≈
                           大驛道    ■漢口 ≈≈
                             │             ≈≈
                      錢  莊-漢-四季美      ≈≈
                             │             ≈≈
                      老通城-┼-碼頭 ■漢陽 ≈≈ 碼頭
                             正             ≈≈  │
                      菊花會-┼-古琴臺      ≈≈ 赤壁  ■武昌
                             │             ≈≈  │
                      藥材店-街-晴川客棧    ≈≈ 黃鶴樓—東湖≈≈
                             │             ≈≈         ≈≈≈≈
                      雜貨店-┼-歸元寺      ≈≈ 
                             │             ≈≈ 
                           黃土路           ≈≈
                             │
               農田-黃土路-黃土路
                │            ＼
山洞-西山小路-麻溪鋪-菜地    <嶽陽>

   ■知府衙門

           書房 — 走廊 — 靈堂 — 甬道 — 牢房
            │      │      │     ︽︽︽︽
   大堂 — 花圃 — 東廂房  廢園┼┼小樓  ︽高
            │             ┼┼┼┼      ︽牆
           客廳 — 膳房      ┼┼︽︽︽︽︽

   ■萬家大院

           北樓 — 書房    ︽︽︽︽︽
            │               ┼┼┼︽圍
   大門 — 大廳 — 東樓 — 花園  ┼︽
            │             ┼┼  ┼︽
           南樓 — 柴房  ┼破祠堂┼︽牆
                         ︽︽︽︽︽︽

TEXT);
		set("value", 50);
		set("material", "paper");
	}
	setup();
}
