// wg_xiwutang2.c

#include <room.h>
inherit ROOM;

void create()
{
	set("short", "習武堂");
	set("long", @LONG
揚州武館是專爲初出江湖的少年設立的。由於江湖叛師是十分爲人
不齒的，初出道的少年可以在此學習一些基本的防身武功，一來不會光
陰虛度，二來也好爲今後選定一個心慕的門派。
    牆上貼着個貼子(tiezi)。
LONG );
	set("item_desc", ([
		"tiezi" : @TEXT
揚州武館敬啓者：不須把所有的基本武功學全。必要的基本武功是：

㈠ 基本內功
㈡ 基本輕功
㈢ 基本招架
㈣ 基本拳腳：基本拳腳、基本手法、基本掌法、基本指法、基本拳法、
             基本爪法、基本腿法任選幾種。
㈤ 基本兵器：基本刀法、基本槍法、基本劍法、基本棍法、基本棒法、
             基本杖法、基本斧法、基本刺法、基本錘法、基本鉤法、
             基本鞭法、基本暗器任選幾種。

----------------------------------------------------------
「揚州武館」所傳授基本武功
----------------------------------------------------------
  １）基本內功 (force)            １２）基本槍法 (spear)
  ２）基本輕功 (dodge)            １３）基本劍法 (sword)
  ３）基本招架 (parry)            １４）基本棍法 (club)
  ４）基本拳腳 (unarmed)          １５）基本棒法 (stick)
  ５）基本手法 (hand)             １６）基本杖法 (staff)
  ６）基本掌法 (strike)           １７）基本斧法 (axe)
  ７）基本指法 (finger)           １８）基本刺法 (dagger)
  ８）基本拳法 (cuff)             １９）基本錘法 (hammer)
  ９）基本爪法 (claw)             ２０）基本鉤法 (hook)
１０）基本腿法 (leg)              ２１）基本鞭法 (whip)
１１）基本刀法 (blade)            ２２）基本暗器 (throwing)
----------------------------------------------------------
「揚州武館」所傳授進階武功
----------------------------------------------------------
  １）太祖長拳 (changquan)          ２）岳家散手 (sanshou)

學習命令是: xue 師傅名 武功技能 次數
TEXT
	]) );
	set("exits", ([
		"east" : __DIR__"wg_shilu-2",
	]));
	set("objects", ([
		__DIR__"npc/wg_jiaotou2" : 1,
	]) );
	set("no_fight",1);
	set("coor/x", 31);
	set("coor/y", -30);
	set("coor/z", 0);
	setup();
	replace_program(ROOM);
}
