// Room: /binghuo/wangpangu2.c
// Date: Oct.28 1999 by Winder

inherit ROOM;

void create()
{
	set("short", "山谷");
	set("long", @LONG
四周長滿了幾百株合抱大松樹。左首山峯前一堵大石壁，壁上刻
着廿四字(zi)，縱橫開闔，宛如施展拳腳一般。但見筆劃多的不覺其
繁，筆劃少的不見其陋，其縮也凝重，似尺蠖之屈，其縱也險勁，如
狡兔之脫，淋漓酣暢，雄渾剛健，俊逸處如風飄，如雪舞，厚重處如
虎蹲，如象步。其中兩個“不”字，兩個“天”字，但兩字寫來形同
而意不同，氣似而神不似，變化之妙，又是另具一功。尤其是“鋒”
字最後一筆，直劃下來，當真是星劍光芒，如矢應機，霆不暇發，電
不及飛。
LONG );
	set("no_sleep_room",1);
	set("outdoors", "wangpan");
	set("item_desc", ([
		"zi":
"　　　　**********************************************\n"
"　　　　********　　        　　　　　　　　　********\n"
"　　　　********　　誰　倚　莫　號　寶　武　　********\n"
"　　　　********　　        　　　　　　　　　********\n"
"　　　　********　　與　天　敢　令　刀　林    ********\n"
"　　　　********　　        　　　　　　　　　********\n"
"　　　　********　　爭　不　不　天　屠　至　　********\n"
"　　　　********　　        　　　　　　　　　********\n"
"　　　　********　　鋒　出　從　下　龍　尊　　********\n"
"　　　　********　　　　　　                　********\n"
"　　　　**********************************************\n",
	]));
	set("exits", ([
		"north"     : __DIR__"wangpangu1",
		"northeast" : __DIR__"wangpanlin",
	]));
	set("objects", ([
		__DIR__"npc/guo" : 1,
		__DIR__"npc/mai" : 1,
		__DIR__"npc/yuan" : 1,
	]));
	setup();
	replace_program(ROOM);
}
