// /d/city/xiangqishi.c
#include <ansi.h>
inherit  ROOM;

string look_book();
string look_jian();
string look_lian();

void create ()
{
	set ("short", "象棋室");
	set ("long", @LONG
適情雅趣屋裏很是雅緻。當中一座大棋盤，棋盤上楚河漢界，將士
躍馬橫炮，《戰國策·秦》雲：“綴甲歷兵，效勝於戰場。”誠如是也。
棋盤邊的小几上擱着一疊薛濤箋(jian)，密密麻麻寫滿不少東西，還有
一些好象是棋經(jing)、詩歌(poem)、棋訣(book)之類的，抄錄得很整
齊，想來頗值一讀(read)。宋·劉克莊《象弈一首呈葉潛仲》詩云：“
小藝無難精，上智有未解。君看橘中戲，妙不出局外。”何不領略一番？
    牆上正北牆上掛了幾副對聯(lian)，桌頭貼了一張小帖子(tie)。
LONG);

	set("no_fight",  1);
	set("objects", ([ /* sizeof() == 4 */
		__DIR__"obj/chess" : 1,
	]));
	set("item_desc", ([
		"poem": HIY"\n	象棋歌訣\n\n"NOR,
		"jing": HIR"\n	棋經論\n\n"NOR,
		"book": (: look_book :),
		"jian": (: look_jian :),
		"lian": (: look_lian :),
		"tie":
"

下子        ：move <橫座標> <縱座標> to <橫座標> <縱座標>
重下        ：reset
讀出殘局    ：deploy
記錄殘局    ：csave
擲骰確定先行：toss
回顧        ：review
認輸        ：lose
觀看棋局    ：look或l board或ccb

",
	]));
	set("exits", ([ /* sizeof() == 1 */
		"west" : __DIR__"qiyiting",
	]));
	set("no_clean_up", 0);
	set("coor/x", 21);
	set("coor/y", 9);
	set("coor/z", 0);
	setup();
}
void init()
{
	add_action("do_read", "read");
}
int do_read(string arg)
{
	if (arg == "poem")
		this_player()->start_more(read_file(__DIR__"obj/chess_book"));
	else
	if (arg == "jing")
		this_player()->start_more(read_file(__DIR__"obj/chess_jing"));
	else
                return notify_fail("你要讀什麼？\n");
	return 1;
}
string look_jian()
{
        return
"
                     以戰爭之象爲棋戲

    回溯歷史，春秋時的戰爭主要是車戰，是四馬拉的各種戰車。
    戰車縱聘於平原之上，卻會受到不平坦地形的阻滯，而步兵則無論密草叢
林、丘陵險隘，……這些地帶對戰車是畏途，對步兵則無往而不利。所以到了
戰國時期，步兵部隊就龐大了起來，形成了以步兵部隊爲主體，配置以戰車的
軍隊。騎兵的發展，自趙武王“胡服騎射”運動之後，從而使戰術是形成步、
騎、車（即車馬兵）的協同作戰的戰術聯合體，使得戰術組織複雜了許多。
    早期的象棋，在定型前除去無炮外，車、馬、兵齊備，這與古代戰爭中的
兵種是一致的，尤其是五個兵卒，正好符合“五兵爲伍”的戰爭中的戰術組合
體。\n"+"
    象棋中的不同兵種協同聯攻的戰術組合體很多，舉不勝舉。諸如：五兵聯
攻，可以形成“五卒擒王”之勢；車馬聯攻，俗稱“車馬冷着”令受攻者防不
勝防；車炮聯攻，能形成“夾車炮”、“滾地雷”以及抽將得子等有迅猛威肋
的殺勢，等等。
    出棋制勝猶如將帥之立奇功，李白計曰：“剪虜若草收奇功！”（《送族
弟館從軍安西》）的機巧戰術，精妙的勝局，使棋迷蕩氣迴腸，如飲甘醴，回
味無窮，妙不可言，是一種超脫世俗的藝術享受！
";
}

string look_book()
{
	string desc, *msg;

	desc = "小冊子上寫了一些和象棋有關的口訣或詩詞，其中一頁寫着：\n\n";

	msg = ({
"【象棋十訣】：
一、開局宜正	二、中變出奇	叄、殘局穩細	四、全局審勢	五、車佔要津
六、馬路疏通	七、炮貴機動	八、兵卒猛進	九、相仕阻敵	十、將帥主攻\n\n",
"棋子全盤叄十二，半爲黑色半爲紅，鴻溝劃處分河界，九路縱橫儘可通。\n\n",
"將軍掛帥決雌雄，衛士相隨鎮九宮，象跨方田隔南北，車行直道任西東，
馬經斜日防旁塞，炮越重巒利遠攻，兵卒勇前無退縮，渡河一步可橫通。\n\n",
"綠樹爲麾蓋，蔭下設棋局，贏者自得意，輸者氣呼呼。\n\n",
"當頭一炮得先多，馬後車前卒渡河，乘勝進攻應反顧，失機堅守切求和。\n\n",
"象棋法與用兵同，謀算全憑佈局工，勝氣爭先終得勢，貪多戀子必無功；
虛心量敵休妄應，刻意求河戒急攻，成敗尋常何畏怯，熟能生巧自精通。\n\n",
	});
	desc += msg[random(sizeof(msg))];
	return desc;
}

string look_lian()
{
	string desc, *msg;

	desc = "牆上是幾副裝裱得十分古雅得對聯，其中一聯寫着：\n\n";

	msg = ({
HIR"
		**************************
		******觀棋不語真君子******
		******起手無回大丈夫******
		**************************\n\n"NOR,
HIG"	****** ******
	* 香 * * 水 *
	* 分 * * 汲 *
	* 花 * * 石 *
	* 上 * * 中 *
	* 露 * * 泉 *
	****** ******\n\n"NOR,
HIC"	****** ******
	* 鼙 * * 暢 *
	* 報 * * 談 *
	* 捷 * * 畫 *
	* 音 * * 事 *
	* 一 * * 兩 *
	* 壺 * * 腋 *
	* 春 * * 生 *
	* 暖 * * 風 *
	****** ******\n\n"NOR,
MAG"	****** ******
	* 瓦 * * 茗 *
	* 壺 * * 碗 *
	* 請 * * 香 *
	* 客 * * 騰 *
	* 邀 * * 遺 *
	* 請 * * 睡 *
	* 客 * * 魔 *
	****** ******\n\n"NOR,

	});
	desc += msg[random(sizeof(msg))];
	return desc;
}
