// fandog.c
# include <ansi.h>
inherit NPC;
void create()
{
	set_name("凡狗", ({ "fandog"}));
        set("title", HIM"網友聯誼會會長"NOR);
	set("gender", "男性");
	set("long", "
這是一隻純種博美名犬，身上的毛沒有幾根，但卻如黃金般
璀璨，梳理得一絲不苟，油光水滑，兩隻眼睛水靈靈的，溫
情脈脈地看着你......人耶？狗耶？如果是狗應是一條好狗，
是人更應是一條好漢！\n");
	set("nickname", HIY"沒毛犬"NOR);
	set("age", 29);
	set("class", "eunach");
	set("attitude", "friendly");
        set("no_get", "1");
	set("inquiry", ([
                 "here": "嘿嘿，泥巴知道吧？會讓你難以自拔，一陷沒頂。\n",
                 "name": "【 天  帝 】千年蟲「思念是一種很好喫的骨頭」凡狗(Fandog)\n",
               "rumors": "最近有一批人質需要護送，江湖上已經有無數豪傑為之送命了。你還是不要輕易嘗試的好。\n",
                 "洗澡": "好啊好啊，你要和我一起洗嗎？我要為你搓搓背，我要為你洗白白。\n",
                 "撒尿": "問我這事幹嘛。羞人答答的説。不過我那樣的時候姿勢還挺優雅。\n",
                 "xuxu": "您也懂俺酷狗幫的黑話？這不現在沒人，您蹲那牆角一尥蹶子就成。\n",
               "洗白白": "我已經夠白的了。我看您脖子上那油漬怪噁心的，回去用潔廁靈抹抹吧。\n",
                  "mud": "你呀，可真是個小呆瓜。你不是在玩泥巴嗎？還問這個幹嘛？\n",
                 "泥巴": "小時候我就愛玩，現在還在玩。玩泥巴那麼久，我連毛都掉光啦，所以人家叫我“沒毛犬”。\n",
               "黃國凡": "你小子給我當心，既然我的底細已經被你知道了，你也命不久矣。\n",
             "laughing": "你説他呀，大帥哥的説。你手頭有漂亮美眉麼，給他來一個。\n",
               "笑笑生": "《金瓶梅》是他寫的。你想看？找我借吧。\n",
                 "風兒": "想不想抱抱他的ｂａｂｙ？嘿嘿，還得看ｊａｖａ的。\n",
                 "仙子": "想不想抱抱他的ｂａｂｙ？嘿嘿，還得看ｗｉｎｄｅｒ的。\n",
                 "java": "一種計算機編程語言。一個印度洋上的小島。一位天后。天帝ｗｉｎｄｅｒ的老婆。一個未來的泥蟲的媽媽。\n",
               "winder": "這小子在長安樂坊開了個賭局，去騙點兒他的錢吧。\n",
                 "凡狗": "沒看見嗎？你面前如此高大威猛的大狗狗。啊，你難道不愛他？\n",
               "fandog": "狗兒的日子簡簡單單，沒什麼好問的。\n",
               "gladys": "她的外事活動由我安排。想找她喫飯嗎？先跟我預約。\n",
                 "降雪": "沒見過下雪麼？那就在泥巴里待著吧。總有一天你能等到的。\n",
		 "lily": "你説的是嚕嚕秋的妻子麼？呀，那可是個大美人哪！嚕嚕秋很疼她的。\n",
                 "ppmm": "這裏太多啦。象老標啦，唐方啦，沈浪啦，全都是。\n",
                 "美眉": "盼望着，盼望着，東風來了，春天的腳步近了。你聰明的，能告訴我，我的美眉在哪裏麼？\n",
            "tomtittot": "你説飯飯呀，她是我妹妹。我們小時候一起搶豬蹄喫，長大了一起寫詩。\n",
                 "飯飯": "問她幹嘛，人家都已經有男朋友了。不怕到北京被暴打一頓嗎？\n",
                  "lcf": "疾風之鈴音？這傢伙成天領了一幫美眉玩星際爭霸，我看他越來越象蟲族的人了。\n",
                "uncle": "靜林？你連你叔都忘了，小時候他還給你把過尿呢。\n這不，峨嵋的掌門周大姑娘剛生了個娃兒，就把你叔給請去帶小\n孩了。那小子豔福不淺哪，嘖嘖，那裏可全是尼姑哪。\n",
                 "wyxl": "小小豬豬？這傢伙有點兒花癡，最近換了個名兒叫“花神”。\n",
                "xxqqf": "老標？跟我一樣流氓。小心別惹他，此人的體重可以把你坐死。\n",
                 "老標": "聽説這小子最近娶了個如花似玉的老婆，脾氣變得好多了。\n",
                  "shh": "他在崑崙山上蓋了幢別墅，昨兒個還請我去他那兒喫水煮活魚來着。\n",
                 "沈浪": "此人已經不再習練七傷拳了，開始鑽研計算機，最近經常在廈大上課。\n",
                 "愛好": "也沒有什麼特別的愛好，偶喜歡多肉的骨頭和——奔～跑～\n",
                  "fhx": "傅紅雪呀，這小子喜歡騎摩托帶美眉兜風，不過最近好象摩托車被偷了，只好玩泥巴啦。也好，泥巴比美眉好玩多了。您説是吧？\n",
                 "asia": "你説小洲啊？這小子整天挖泥巴，昨兒個拿了一沓電話帳單哭着找我來了，説是他爸準備ＰＫ他了。\n",
               "傅紅雪": "這傢伙可不是美眉，雖然名字很香豔。你想泡他？人家一招你就沒屁了。\n",
                 "葉開": "你問的這個人哪，名聲太響啦。不過這小子跟我交情不錯，你有什麼要他幫忙的麼？比如介紹你認識認識麗春院的老鴇婆什麼的？\n",
               "蘇明泉": "好小子，你從哪裏聽到這個名字的？估計你活不過晌午了。\n",
               "葉亞洲": "哦，你問他？他已經是江湖一代名俠了，傳説中的武當劍客小白龍，桃花仙子阿紫，美豔神祕的上官小仙和慕容小雪，其實全是他。\n",
                  "top": "寒星？他喜歡和老婆一起在山上種茶，在屋旁澆花。他的外號叫烏龍茶，老婆若冰外號是鐵觀音，大兒子本雪在大理當差種茶花，小女兒月兔正招親呢。\n",
                 "bsrx": "碧水柔星？那可是武當派大師兄，名頭可響亮了。她有好多女兒，藍蝴蝶，紅蝴蝶，花蝴蝶，成天飛來飛去的讓人眼花呢。\n",
                "donal": "小唐？這小子挺能整的，跟一鍵無雪兩個大老爺們生了三個大胖小子。\n",
                "glass": "要是哪天樹葉兒落了，荷花謝了，簾卷西風了，人比黃花瘦了，那你就能看到她了。\n",
              "mamagic": "小魔女？華山的小姑娘。有她老公黑月追風罩着，我看你還是別惹她了。\n",
                  "dra": "不如歸去？這會兒你上街沽一壺酒，買點兒醬鴨滷肉，\n等你回來，他呀，一準在你家窩着了。這小子練功稀稀拉拉的，\n可要是有賭局酒席，他就屁顛屁顛地來啦。咳，也是，打打殺殺\n那麼累幹嘛，不如歸去，回家陪老婆去。\n",     
                 "zell": "風？吹過，就沒影兒了。不過你還是能見到他，有時他來這裏看看老婆。\n",
                   "pk": "好小子，我看你臉上一股黑氣，可能大難臨頭了。勸你還是少做惡人的好。\n",
                 "流氓": "誰？你説誰哪？哥們兒，你今兒個可找對主兒了。咱們這就開練？是單挑還是羣毆，隨便。\n",
                "wendy": "隨緣？小夥子人挺好，就是不好好練功，成天老想着泡妞，你可別跟他學。\n",
                  "lzw": "你説的那是李大嘴。咳，她呀，從小就不喫飯，整天\n喫菩提子人蔘果，結果把嘴巴喫大了，成天朝人咧嘴呵呵傻笑：\n嘿，有沒有好喫的。瞧那饞樣兒。\n",
            "bloodgirl": "哦，她呀，從前叫林天雨，長得可好看了。從小呀，\n她奶媽李大嘴就寵着她，性子嬌弱了點兒。上回失戀，她差點沒\n割脈，後來大夥兒一直勸她才沒死成，不過改了個名兒叫火鳳凰。\n",
                 "rewj": "阿卡呀，這小子人不錯，不過喜歡和女孩子混在一起，這不，到峨嵋山陪尼姑去了。\n",
                 "狗屎": "想喫嗎？我有現成的。\n",
                 "大便": "問我這個幹嘛？你自己撅撅屁股不就有了？\n",
                  "roc": "這小子偷香竊玉，過去是個雪山的禿驢，近來加入明教，不再做強搶民女的壞事啦。他和小唐開了個鏢局，有什麼護送人質的事情就去找他吧。\n",
                  "ljf": "這傢伙也是一竊玉偷香的好手，把臺灣的漂亮美眉輕舞飛揚都騙到手啦。\n",
            "hackerfan": "一鍵無雪？他呀，酷愛男扮女裝，武當的師傅不喜歡他，他到五毒教去啦。\n",
                "perty": "你找他幹嘛？他可沒我豐滿。要喫火鍋，還是用我的肉比較好。\n",
                 "wdss": "哦，小寶啊，我跟他很熟。這人比較搞笑，你要是什麼時候覺着煩了，就找他吹吹牛吧。\n",
             "raingirl": "您可千萬千萬瞅仔細嘍，這小子不是美眉。看他走路的樣子就知道了，雖然屁股扭來扭去的，可身子沒那風情。\n",
               "方寶兒": "寶兒也是你叫的？我看你是找打。\n",
                  "jjh": "交際花？哈哈，找他幹嘛？他最近手頭倒是有幾個浙江妹，不過價錢貴得很哪。\n",
               "qingyi": "青衣？唉，這孩子也真可憐，情竇初開就當了太監。聽説他對大美女唐方有點意思，可人家喜歡猛男，他只好狂練ＤＦ，整天扛把機關槍四處轉悠。\n",
               "huamao": "唐方？人家説那是個大美女，跟小龍女也差不了多少，可那天我看見他在洗澡，哇噻，你猜怎麼着？原來是一大老爺們。\n",
                 "唐方": "那是人家寶兒的媳婦兒，這不快過年啦，小兩口出門買年貨去啦。\n",
                "apple": "水母陰姬？您別説，那桃花島娘們兒徐娘半老，還挺有那麼點兒風韻的，長得有點象麥當勞的蘋果派。\n",
            "baobutong": "包不同？這可是個厲害角色，能説會道，還養了一籮筐的毒蟲，什麼蠍子呀，蜘蛛呀，哇哇，好可怕。\n",
              "flybird": "飛鳥？華山的一哥們兒。喜歡在芙蓉和石井之間飛來飛去的。\n",
               "waiter": "你説小二呀，他不在醉仙樓端茶倒水啦，跑香港去唸博士啦。\n",
               "店小二": "我鐵哥們兒。那天我在深圳和他從早上喝到晌午，從茶樓喝到麥當勞再到東北小館子，從鐵觀音喝到可樂咖啡再到白酒冰啤，鼻涕眼淚汗疙瘩都出來了。\n",
                  "xem": "峨嵋的老尼姑呀，你問她幹嘛？去武廟三樓找她吧。\n",
                 "shit": "我的屁股擦得很乾淨，沒有狗屎讓你舔。抱歉了。\n",
                 "殺狗": "如果你殺了我準備清燉，那麼建議你買口大鍋，本狗的肉還是不少的，起碼夠你全家喫一個臘月。\n",
                 "狗肉": "那可是很好喫的東西呀。不過跟我沒什麼關係。別老在我面前咽口水，你個死三八。\n",
             "spacenet": "嚕嚕秋？最近帶他的小蜜兒度假去啦。有什麼事找他們宿舍的奶牛就好了。\n",
                "along": "你説奶牛呀？他成天往石井跑，這會兒八成又去啦。\n",
              "batwing": "柳隨風？那可是一位大俠呀。您要是有什麼事，找他準行。\n",
             "tempness": "你是説來來往往？也叫阿貓阿狗。這小子最愛造謠了，喜歡看到屏幕被自己搞得粉紅一片。\n",
              "automan": "笑三少？小傢伙很聰明，就是皮了點兒。\n",
                 "swgr": "夏洋？人小鬼大，精靈古怪，功課不錯，掙錢不少。\n",
               "我是誰": "你不知道我是誰？我也不知道。可是你是誰？又有什麼資格問我是誰？\n",
                "sharp": "一箭穿心？鬼知道那一箭射到誰了，他能射到誰呀！？\n",
                 "pass": "阿拐？他在南京，好久沒來啦。\n",
                 "sega": "天星？哈哈，跟我一樣，又肥又白。如果説我比較適合清燉，他可能比較適合紅燒。\n",

                 "泡妞": "你小子最近可真有點兒悶騷。要不怕死，晚上就跟我摸進石井吧。\n",
                   "mm": "美眉？我勸你還是撒泡尿先照照自己的模樣兒。瞧見了吧，就你那樣兒，五短身材，賊眉鼠眼的，最多也就能泡上個阿慶嫂。\n",
             "constant": "不要亂打聽，見着他你叫一聲“大爺”準沒錯。\n",
              "heretic": "這可是你大爺，沒事別亂打聽。\n",
                 "dean": "蕭傲？好久沒來啦。此人已經不在江湖，你就別打聽了吧。\n",
              "zeratul": "寒江雪？一個老頭子，喜歡釣魚，去找他學兩招吧。\n",

	]));

	setup();
	carry_object(CLOTH_DIR"male-cloth")->wear();
        carry_object(CLOTH_DIR"male-shoe")->wear();
}
void relay_emote(object ob, string verb)
{
      if( !userp(ob) ) return;

      switch(verb)
      {
                 case "zhu":
                 command("pig1 " + ob->query("id"));
                 command("niu ");
                 break;
                 case "puke":
                 command("pei ");
                 command("seal " + ob->query("id"));
                 break;
                 case "seal":
                 command("heng ");
                 command("cuff " + ob->query("id"));
                 break;
                 case "hi":
                 command("brother1 " + ob->query("id"));
                 break;
                 case "wanfu":
                 command("count " + ob->query("id"));
                 break;
                 case "kick":
                 command("say 靠，你小子敢踢我。我不打得你滿臉桃花開，你就不知道花兒為什麼這麼紅！");
                 command("claw " + ob->query("id"));
                 break;
            case "slap":
                 command("say 你小子活膩了不成？敢碰大狗狗的漂亮臉蛋兒？");
                 command("cuo " + ob->query("id"));
                 break;
            case "hammer":
                 command("pain ");
                 command("pain " + ob->query("id"));
                 break;
            case "hammer1":
                 command("pain ");
                 command("pain " + ob->query("id"));
                 break; 
            case "hammer2":
                 command("pain ");
                 command("pain " + ob->query("id"));
                 break; 
            case "pk":
                 command("grin ");
                 command("bigman " + ob->query("id"));
                 break;
            case "pk1":
                 command("grin " + ob->query("id"));
                 command("doubt " + ob->query("id"));
                 break;
            case "nip":
                 command("axe " + ob->query("id"));
                 break;
            case "claw":
                 command("staff " + ob->query("id"));
                 break;
            case "faint":
                 command("inn1 " + ob->query("id"));
                 break;
            case "sigh":
                 command("sigh1 ");
                 command("sigh1 " + ob->query("id"));
                 break;
            case "benger":
                 command("pain ");
                 command("pain " + ob->query("id"));
                 break; 
            case "trip":
                 command("pain ");
                 command("inn1 " + ob->query("id"));
                 break; 
            case "bite":
                 command("bite ");
                 command("chan " + ob->query("id"));
                 break;
            case "papaya":
                 command("heng ");
                 command("pig1 " + ob->query("id"));
                 break;
            case "mo":
                 command("giggle ");
                 command("taoyan " + ob->query("id"));
                 break;
            case "cuo":
                 command("pain ");
                 command("say 有點疼，不過還挺舒服的。");
                 command("giggle ");
                 break;
            case "pig1":
                 command("angry ");
                 command("piggy " + ob->query("id"));
                 break;

      }
}
