// qingxu.c 清虛

#include "daozhang.h"
inherit NPC;
inherit F_MASTER;
inherit F_UNIQUE;

void create()
{
        set_name("清虛道長", ({ "qingxu daozhang", "qingxu", "daozhang" }));
        set("long","他是張松溪的弟子，劍術算不得很精，但年輕之時，曾在西域住過十幾年，\n學得一項特別本事，精擅機關削器之術。\n他今年三十八歲，主管武當派後山的俗事。\n");
        set("gender", "男性");
        set("age", 38);
        set("attitude", "peaceful");
        set("shen_type", 1);
        set("class", "taoist");
        set("str", 25);
        set("int", 25);
        set("con", 25);
        set("dex", 25);

        set("max_qi", 1500);
        set("max_jing", 800);
        set("neili", 1000);
        set("max_neili", 1000);
        set("jiali", 30);
        set("combat_exp", 60000);
        set("score", 8000);

        set_skill("force", 50);
        set_skill("taiji-shengong", 50);
        set_skill("dodge", 50);
        set_skill("tiyunzong", 70);
        set_skill("unarmed", 60);
        set_skill("taiji-quan", 60);
        set_skill("parry", 50);
        set_skill("sword", 60);
        set_skill("wudang-jian", 40);
        set_skill("wudang-quan", 40);
        set_skill("taoism", 50);
        set_skill("literate", 50);

        map_skill("force", "taiji-shengong");
        map_skill("dodge", "tiyunzong");
        map_skill("unarmed", "taiji-quan");
        map_skill("parry", "wudang-jian");
        map_skill("sword", "wudang-jian");
	set("inquiry", ([
		"name" : "貧道便是清虛，不知這位"+ RANK_D->query_respect(this_player())+"有何見教？",
		"武當" : "貧道便是武當派弟子，不知這位"+ RANK_D->query_respect(this_player())+"有何見教？",
		"武當派" : "貧道便是武當派弟子，不知這位"+ RANK_D->query_respect(this_player())+"有何見教？",
		"太極劍" : "嗯……這我不大清楚，你得去問沖虛師兄。",
		"太極劍法" : "嗯……這我不大清楚，你得去問沖虛師兄。",
		"武當劍" : "嗯……武當劍的質地柔韌不足，堅硬易脆，對方如果使用重器械，則不宜與其硬碰硬撞。",
		"武當劍法" : "武當劍法使起來又狠又穩，一招之間能生出許多變化。",
		"兩儀劍法" : "兩儀劍法中有陰有陽，亦剛亦柔，神妙精微無比。",
		"武當兩儀劍" : "兩儀劍法中有陰有陽，亦剛亦柔，神妙精微無比。",
		"繞指柔劍" : "這路劍法我可不會使。",
		"神門十三劍" : "這路劍法我可不會使。",
		"武當長拳" : "拳腳功夫非貧道所長。",
		"綿掌" : "拳腳功夫非貧道所長。",
		"震山掌" : "拳腳功夫非貧道所長。",
		"虎爪絕戶手" : "嗯……曾聽說敝派有這一路武功，但從未見師伯師叔使過。",
		"張三豐" : "敝派創派祖師，近年來常年閉關不出。",
		"張真人" : "敝派創派祖師，近年來常年閉關不出。",
		"宋遠橋" : "那是敝派掌門大師伯。",
		"宋大俠" : "那是敝派掌門大師伯。",
		"俞蓮舟" : "那是二師伯。",
		"俞二俠" : "那是二師伯。",
		"俞岱巖" : "那是三師伯。",
		"俞三俠" : "那是三師伯。",
		"張松溪" : "貧道的授業恩師",
		"張四俠" : "貧道的授業恩師",
		"張翠山" : "………那是貧道的五師叔。",
		"張五俠" : "………那是貧道的五師叔。",
		"殷梨亭" : "那是六師叔。",
		"殷六俠" : "那是六師叔。",
		"莫聲谷" : "那是七師叔。",
		"莫七俠" : "那是七師叔。",
		"宋青書" : "好久沒見到宋師哥了，聽說他和莫七叔吵過架，就此再沒回武當過。",
		"沖虛" : "他是貧道的師兄，三代弟子中也就他會使太極劍法。",
		"沖虛道長" : "他是貧道的師兄，三代弟子中也就他會使太極劍法。",
		"谷虛" : "谷虛師兄是三代弟子中的佼佼者，近年來負責在山上主持武當事務。",
		"谷虛道長" : "谷虛師兄是三代弟子中的佼佼者，近年來負責在山上主持武當事務。",
		"清虛道長" : "貧道便是清虛，不知這位"+ RANK_D->query_respect(this_player())+"有何見教？",
		"凌虛" : "凌虛師弟在遇真宮，負責製造香火。",
		"凌虛道長" : "凌虛師弟在遇真宮，負責製造香火。",
		"制香" : "凌虛師弟在遇真宮，負責製造香火。",
		"制香道長" : "凌虛師弟在遇真宮，負責製造香火。",
		"靈虛" : "靈虛師弟在山門，負責接待來客。",
		"靈虛道長" : "靈虛師弟在山門，負責接待來客。",
		"知客" : "靈虛師弟在山門，負責接待來客。",
		"知客道長" : "靈虛師弟在山門，負責接待來客。",
		"成高" : "他是貧道的師侄，以前曾與貧道在西域住過十幾年，現在負責看守榔梅園。",
		"成高道長" : "他是貧道的師侄，以前曾與貧道在西域住過十幾年，現在負責看守榔梅園。",
		"守園" : "他是貧道的師侄，以前曾與貧道在西域住過十幾年，現在負責看守榔梅園。",
		"守園道長" : "他是貧道的師侄，以前曾與貧道在西域住過十幾年，現在負責看守榔梅園。",
		"炸藥" : "嗯……這我不大清楚，你得去問成高師侄。",
		"火藥" : "嗯……這我不大清楚，你得去問成高師侄。",
		"製造炸藥" : "嗯……這我不大清楚，你得去問成高師侄。",
		"製造火藥" : "嗯……這我不大清楚，你得去問成高師侄。",
		"機關" : "貧道曾在西域向當地工匠學過機關削器之術。",
		"機關削器" : "貧道曾在西域向當地工匠學過此術。",
		"清虛" : "貧道便是清虛，不知這位"+ RANK_D->query_respect(this_player())+"有何見教？",
	]));
        set("env/wimpy", 60);
        create_family("武當派", 3, "弟子");

        setup();
	carry_object(WEAPON_DIR"changjian")->wield();
	carry_object(CLOTH_DIR"dao-cloth")->wear();
	carry_object(CLOTH_DIR"dao-shoe")->wear();
}

